# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Revisão Aula 25
#+Subtitle: *INF01202*
#+Author: Prof. Lucas Mello Schnorr
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS: title:nil H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel.tex}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{systeme}

#+latex: \newcommand{\mytitle}{Revisão Aula 25}
#+latex: \mytitleslide

* Configuração                                                     :noexport:

#+BEGIN_SRC emacs-lisp
(setq org-latex-listings 'minted
      org-latex-packages-alist '(("" "minted"))
      org-latex-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
(setq org-latex-minted-options
       '(("frame" "lines")
         ("fontsize" "\\scriptsize")))
#+END_SRC

#+RESULTS:
| frame    | lines       |
| fontsize | \scriptsize |

* 2. Passagem de parâmetros /por valor/ (~a25-troca.c~)

#+attr_latex: :options fontsize=\scriptsize
#+BEGIN_SRC C :tangle e/a25-troca.c
#include <stdio.h>
void troca (int x, int y) {
  int temp;
  temp = x;
  x = y;
  y = temp;
  return;
}
int main() {
  int a, b;
  a = 5;
  b = 10;
  printf("#1: a = %d, b = %d\n", a, b);
  troca(a, b);
  printf("#2: a = %d, b = %d\n", a, b);
  return 0;
}
#+END_SRC

#+begin_src shell :results output :exports both :dir e
gcc a25-troca.c; ./a.out
#+end_src

#+RESULTS:
: #1 a = 5, b = 10
: #2 a = 5, b = 10

\to _/Por quê?/_
* (#1) Compilação e testes

Para compilar, passamos ao compilador os três módulos (arquivos ~.c~):

#+BEGIN_SRC bash :results output :exports both :dir e
gcc -Wall rev-a25-main.c rev-a25-enax.c rev-a25-aux.c -lm
#+END_SRC

#+RESULTS:

Teste

#+BEGIN_SRC bash :results output :exports both :dir e
echo "3" | ./a.out
#+END_SRC

#+RESULTS:
: Por favor, valor de x: O valor de e elevado na 3.000000 é: 20.085537
